cmsis-svd/cmsis-svd/data/Microchip/ATSAMC21E.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Microchip Technology Inc.</vendor>
  <vendorID>MICROCHIP</vendorID>
  <name>ATSAMC21E</name>
  <series>SAMC21</series>
  <version>C</version>
  <description>Microchip ATSAMC21E devices</description>
  <licenseText>
  Copyright (c) 2018 Microchip Technology Inc.\n
\n
  SPDX-License-Identifier: Apache-2.0\n
\n
  Licensed under the Apache License, Version 2.0 (the "License");\n
  you may not use this file except in compliance with the License.\n
  You may obtain a copy of the License at\n
\n
  http://www.apache.org/licenses/LICENSE-2.0\n
\n
  Unless required by applicable law or agreed to in writing, software\n
  distributed under the License is distributed on an "AS IS" BASIS,\n
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n
  See the License for the specific language governing permissions and\n
  limitations under the License.
  </licenseText>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
    <deviceNumInterrupts>31</deviceNumInterrupts>
  </cpu>
  <headerSystemFilename>system_samc21</headerSystemFilename>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <version>1.1.1</version>
      <description>Analog Comparators</description>
      <groupName>AC</groupName>
      <prependToName>AC_</prependToName>
      <baseAddress>0x42005000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AC</name>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START0</name>
              <description>Comparator 0 Start Comparison</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START1</name>
              <description>Comparator 1 Start Comparison</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START2</name>
              <description>Comparator 2 Start Comparison</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START3</name>
              <description>Comparator 3 Start Comparison</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COMPEO0</name>
              <description>Comparator 0 Event Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEO1</name>
              <description>Comparator 1 Event Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEO2</name>
              <description>Comparator 2 Event Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEO3</name>
              <description>Comparator 3 Event Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINEO0</name>
              <description>Window 0 Event Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINEO1</name>
              <description>Window 1 Event Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEI0</name>
              <description>Comparator 0 Event Input Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEI1</name>
              <description>Comparator 1 Event Input Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEI2</name>
              <description>Comparator 2 Event Input Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEI3</name>
              <description>Comparator 3 Event Input Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEI0</name>
              <description>Comparator 0 Input Event Invert Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEI1</name>
              <description>Comparator 1 Input Event Invert Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEI2</name>
              <description>Comparator 2 Input Event Invert Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEI3</name>
              <description>Comparator 3 Input Event Invert Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2</name>
              <description>Comparator 2 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP3</name>
              <description>Comparator 3 Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN0</name>
              <description>Window 0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN1</name>
              <description>Window 1 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2</name>
              <description>Comparator 2 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP3</name>
              <description>Comparator 3 Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN0</name>
              <description>Window 0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN1</name>
              <description>Window 1 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Comparator 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1</name>
              <description>Comparator 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2</name>
              <description>Comparator 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP3</name>
              <description>Comparator 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN0</name>
              <description>Window 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN1</name>
              <description>Window 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSA</name>
          <description>Status A</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE0</name>
              <description>Comparator 0 Current State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE1</name>
              <description>Comparator 1 Current State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE2</name>
              <description>Comparator 2 Current State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE3</name>
              <description>Comparator 3 Current State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WSTATE0</name>
              <description>Window 0 Current State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>WSTATE0Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Signal is above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Signal is inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Signal is below window</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSTATE1</name>
              <description>Window 1 Current State</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>WSTATE1Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Signal is above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Signal is inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Signal is below window</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSB</name>
          <description>Status B</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY0</name>
              <description>Comparator 0 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY1</name>
              <description>Comparator 1 Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY2</name>
              <description>Comparator 2 Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY3</name>
              <description>Comparator 3 Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINCTRL</name>
          <description>Window Control</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WEN0</name>
              <description>Window 0 Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINTSEL0</name>
              <description>Window 0 Interrupt Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WINTSEL0Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Interrupt on signal above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Interrupt on signal inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Interrupt on signal below window</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>Interrupt on signal outside window</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WEN1</name>
              <description>Window 1 Mode Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINTSEL1</name>
              <description>Window 1 Interrupt Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WINTSEL1Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Interrupt on signal above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Interrupt on signal inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Interrupt on signal below window</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>Interrupt on signal outside window</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>SCALER%s</name>
          <description>Scaler n</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Scaler Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
